validation/AMR/cylinderBenchmark/RANS/2D_alt/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

topoChanger
{
    type              multiFieldRefiner2D;

    libs              ("libfvMeshTopoChangers2D.so");

    // How often to refine
    refineInterval    512;

    // Fields to use for refinement
    refinementFields
    {
            object
            {
                // Refine based on geometry constraint
                type                geometry;
                surface             "object.stl";
                mode                inside;
                operation           default;
            }

            normalizedMagGradU
            {
                // Refine field in between lower..upper
                lowerRefineLevel    0.2;
                upperRefineLevel    1.0;
                operation           OR;
            }

            normalizedVorticity
            {
                // Refine field in between lower..upper
                lowerRefineLevel    0.2;
                upperRefineLevel    1.0;
                operation           OR;
            }
    }

    // Have slower than 2:1 refinement
    nBufferLayers     8;

    // Refine cells only up to maxRefinement levels
    maxRefinement     2;

    // Stop refinement if maxCells reached
    maxCells          2500000;

    // Flux field and corresponding velocity field. Fluxes on changed
    // faces get recalculated by interpolating the velocity. Use 'none'
    // on surfaceScalarFields that do not need to be reinterpolated.
    correctFluxes
    (
        (phi none)
        (nHatf none)
        (rhoPhi none)
        (meshPhi none)
        (meshPhi_0 none)
        (ghf none)
    );

    // Write the refinement level as a volScalarField
    dumpLevel       	true;
}

distributor
{
    type                    distributor;

    libs                    ("libfvMeshDistributors.so");

    // How often to redistribute
    redistributionInterval  1;

    // Maximum fractional cell distribution imbalance
    // before rebalancing
    maxImbalance            0.1;
}

// ************************************************************************* //
