validation/AMR/cylinderBenchmark/RANS/2D_alt/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
	default			backward;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default									none;
	div(phi,U)								Gauss limitedLinearV 1;
    div((nuEff*dev2(T(grad(U)))))			Gauss linear;
}

laplacianSchemes
{
    default			Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

// ************************************************************************* //
